package com.example.onlyofficetest.domain.repositories

/**
 * Репозиторий для данных пользователя (токены, признак авторизации и т.д.)
 */
interface UserDataRepository {

    /**
     * Сохраняет токен аутентификации
     *
     * @param accessToken Токен аутентификации для сохранения
     */
    fun saveAccessToken(accessToken: String)

    /**
     * Возвращает токен аутентификации
     *
     * @return Токен аутиентификации
     */
    fun getAccessToken(): String

    /**
     * Возвращает признак того, авторизован ли пользователь с помощью токена аутентификации.
     * Если пользователь не авторизован, при запуске приложения открывается экран авторизации.
     *
     * @return Признак того, авторизован ли пользователь с помощью токена аутентификации
     */
    fun getAuthorizedWithToken(): Boolean

    /**
     * Сохраняет признак того, авторизован ли пользователь с помощью токена аутентификации.
     * Если пользователь не авторизован, при запуске приложения открывается экран авторизации.
     *
     * @param value Признак того, авторизован ли пользователь с помощью токена аутентификации
     */
    fun saveAuthorizedWithToken(value: Boolean)

    /**
     * Сохраняет адрес портала (базовый URL для Retrofit)
     *
     * @param baseUrl Базовый URL для сохранения
     */
    fun saveBaseUrl(baseUrl: String)

    /**
     * Возвращает адрес портала (базовый URL для Retrofit)
     *
     * @return Базовый URL
     */
    fun getBaseUrl(): String
}